flowOverADisk2D/linearUpwindStabilizedTransportScheme_U0.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       31680;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       31730;
    }
    upperWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          170;
        startFace       31780;
    }
    lowerWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          170;
        startFace       31950;
    }
    cylinderWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       32120;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32000;
        startFace       32320;
    }
)

// ************************************************************************* //
