flowOverADisk2D/linearUpwindStabilizedTransportScheme_U0.5/0_orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 181728;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(lowerWallStartup|upperWallStartup)"
    {
        type            symmetryPlane;
    }

    "(upperWall|lowerWall)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
