flowOverADisk2D/linearUpwindStabilizedTransportScheme_U0.5/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
